Revit 2027 API
PresetInitialColor Class
 This class encapsulates a preset initial lighting color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.PresetInitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PresetInitialColor : InitialColor
Public Class PresetInitialColor
	Inherits InitialColor
public ref class PresetInitialColor : public InitialColor
type PresetInitialColor =
    class
        inherit InitialColor
    end
The PresetInitialColor type exposes the following members.
Constructors
Name | Description
PresetInitialColor(ColorPreset) |  Creates an initial color preset object with the given preset value.
PresetInitialColor(PresetInitialColor) |  Creates a copy of the given preset initial color
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from InitialColor)
Preset |  The preset value
TemperatureValue |  The light color temperature value in Kelvins.
(Inherited from InitialColor)
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
(Inherited from InitialColor)
Dispose
(Inherited from InitialColor)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace